{
  "backend/main.mo": "Runs the migration module and defines an empty actor.",
  "backend/migration.mo": "Migration stub that returns state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping build issues to related frontend config files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind base styles plus custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point enabling dark mode and loading the React app with Inter font and SEO tags.",
  "frontend/postcss.config.cjs": "CommonJS PostCSS config enabling Tailwind and autoprefixer plugins.",
  "frontend/src/App.tsx": "Main React app rendering hero, sections, navigation, menu grids, and reveal-on-scroll behavior.",
  "frontend/src/components/LocationMapPreview.tsx": "Map preview with iframe embed, loading state, and fallback card if embedding fails.",
  "frontend/src/components/MenuCategoryGrid.tsx": "Displays a menu category with its image and items in a responsive grid.",
  "frontend/src/components/MenuItemCard.tsx": "Renders a menu item with image, prices, and a WhatsApp order button if configured.",
  "frontend/src/components/RevealableSection.tsx": "Wrapper that hides or reveals a section based on state while preserving navigation IDs.",
  "frontend/src/components/SafeImage.tsx": "Image component that swaps to a fallback source on load failure.",
  "frontend/src/components/Section.tsx": "Generic layout section with optional muted background styling.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with logo and navigation, including mobile menu toggling and section navigation callbacks.",
  "frontend/src/content/business.ts": "Centralized business configuration defining branding, contact info, hours, map URLs, WhatsApp settings, and menu categories with images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query backend hooks.",
  "frontend/src/hooks/useRevealableSections.ts": "Tracks which page sections are revealed and provides utilities to reveal and smoothly scroll to sections.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for dark and light modes with premium shadow and utility classes.",
  "frontend/src/lib/whatsapp.ts": "Builds WhatsApp order links using menu item details and checks whether WhatsApp ordering is configured.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, shadows, fonts, animations, and enabling plugins.",
  "project_state.json": "Describes the current state of a single‑page marketing site including new requirements for unique menu item images and WhatsApp ordering. Lists architectural notes, known issues, and existing features relevant to branding, layout, and menu rendering."
}