{
  "backend/main.mo": "Minimal Motoko actor with no logic, reserved for future migrations.",
  "feature_evidence.json": "Feature evidence report listing planned logo, UI update, and favicon tasks with associated files and components.",
  "frontend-file-summaries.txt": "Contains short summaries for all frontend source files, describing their roles and features.",
  "frontend/index.css": "Global Tailwind-based styling defining OKLCH color tokens and dark mode variables.",
  "frontend/index.html": "Main HTML entry with dark theme, Inter font, and favicon linking to the new HND badge asset.",
  "frontend/postcss.config.cjs": "PostCSS config enabling TailwindCSS and autoprefixer.",
  "frontend/src/App.tsx": "Main React app rendering hero, menu, map, and section-reveal navigation using the new HND badge logo.",
  "frontend/src/components/LocationMapPreview.tsx": "Embeds Google Maps with loading state and fallback card when embedding fails.",
  "frontend/src/components/MenuCategoryGrid.tsx": "Renders a menu category header and responsive grid of menu item cards.",
  "frontend/src/components/MenuItemCard.tsx": "Detailed menu card with image, pricing, WhatsApp ordering, and variant selection dialog.",
  "frontend/src/components/RevealableSection.tsx": "Wrapper around Section that toggles visibility and aria-hidden based on isRevealed.",
  "frontend/src/components/SafeImage.tsx": "Image component that swaps to a fallback source if the main image fails to load.",
  "frontend/src/components/Section.tsx": "Generic section wrapper applying background styles and padding with a container div.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with logo, desktop nav, and mobile sheet menu triggering section navigation.",
  "frontend/src/content/business.ts": "Central business config including metadata, hours, contact info, menu items, and image helpers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors, refetching queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth client, login/logout handling, and identity state via context.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future backend-related React Query hooks.",
  "frontend/src/hooks/useRevealableSections.ts": "Manages which sections are revealed and provides smooth scrolling after reveal.",
  "frontend/src/index.css": "Tailwind-based global styles and custom utilities for a premium dark theme with animations.",
  "frontend/src/lib/whatsapp.ts": "Builds WhatsApp order links and derives menu item variant pricing options.",
  "frontend/src/main.tsx": "App entry point initializing React Query, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, typography/container/animate plugins, extended theme settings, and custom animations.",
  "project_state.json": "Project state file detailing site requirements, branding updates, menu rules, ordering UX, architectural notes, issues, and image specifications."
}