{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence describing required category banner image updates and static asset additions.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files, describing structure and behavior.",
  "frontend/index.css": "Defines global Tailwind styles with OKLCH color tokens, light/dark theme variables, and base element styling.",
  "frontend/index.html": "HTML entry point loading fonts, favicon, and root element with enforced light background.",
  "frontend/postcss.config.cjs": "PostCSS config enabling Tailwind and Autoprefixer plugins.",
  "frontend/src/App.tsx": "Main React SPA rendering header, hero, menu categories, and map preview with section switching logic.",
  "frontend/src/components/LocationMapPreview.tsx": "Map component embedding Google Maps with loading state and fallback card if embedding fails.",
  "frontend/src/components/MenuCategoryGrid.tsx": "Renders a category banner image, title, and responsive grid of menu item cards.",
  "frontend/src/components/MenuItemCard.tsx": "Displays menu item details with WhatsApp ordering and optional variant selection dialog.",
  "frontend/src/components/RevealableSection.tsx": "Renders a Section only when isRevealed is true, passing background and classes through.",
  "frontend/src/components/SafeImage.tsx": "Displays an image that swaps to a fallback on load error and resets when src changes.",
  "frontend/src/components/Section.tsx": "Wraps children in a styled section with variant-based background classes.",
  "frontend/src/components/SiteHeader.tsx": "Fixed header with logo and navigation buttons that trigger section navigation.",
  "frontend/src/content/business.ts": "Stores business metadata, menu helpers, images, hours, contact info, and WhatsApp config.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, status, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for backend-related React Query hooks.",
  "frontend/src/hooks/useRevealableSections.ts": "Manages which section is active and handles reveal logic with scroll adjustment.",
  "frontend/src/index.css": "Tailwind base styles, theme variables, animations, and utility classes for the site.",
  "frontend/src/lib/whatsapp.ts": "Builds WhatsApp order links and derives variant pricing options for menu items.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, fonts, shadows, and animations with typography, container query, and animate plugins.",
  "project_state.json": "Project state metadata defining site requirements, branding changes, menu rules, image needs, known issues, and existing features."
}