{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing UI modification features and affected files.",
  "frontend-file-summaries.txt": "Collection of short summaries describing purpose of all frontend files.",
  "frontend/index.css": "Tailwind base styles with OKLCH color variables and dark mode adjustments.",
  "frontend/index.html": "HTML entry point enabling dark mode, loading fonts, and mounting the React app.",
  "frontend/postcss.config.cjs": "PostCSS config enabling Tailwind and autoprefixer.",
  "frontend/src/App.tsx": "Main app component rendering hero, navigation, sections, and menu using animations and dynamic content.",
  "frontend/src/components/LocationMapPreview.tsx": "Map preview with iframe embedding, loading state, and fallback card when embed fails.",
  "frontend/src/components/MenuCategoryGrid.tsx": "Renders a menu category title and grid of animated MenuItemCard components.",
  "frontend/src/components/MenuItemCard.tsx": "Displays a menu item card with pricing and opens WhatsApp order links, including variant selection via dialog.",
  "frontend/src/components/RevealableSection.tsx": "Wraps content in a Section and renders only when the section is marked as revealed.",
  "frontend/src/components/SafeImage.tsx": "Renders an image that swaps to a fallback source if loading fails and resets on src change.",
  "frontend/src/components/Section.tsx": "Provides a styled section wrapper with background variants and fade-in animation.",
  "frontend/src/components/SiteHeader.tsx": "Renders the fixed site header with logo and scrollable navigation buttons.",
  "frontend/src/content/business.ts": "Centralized business config including branding, menu data, social links, images, and WhatsApp settings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future backend-related React Query hooks.",
  "frontend/src/hooks/useRevealableSections.ts": "Tracks and controls which page section is revealed and scrolls to top on section change.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, animations, and utility classes.",
  "frontend/src/lib/whatsapp.ts": "Functions to derive variant pricing options for menu items and generate WhatsApp order links using business configuration.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and utility settings.",
  "project_state.json": "Project state metadata describing requirements, branding updates, menu logic, ordering flow, and known issues."
}