{
  "backend/main.mo": "Empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Lists implemented features with associated file paths, components, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains human‑written summaries of all frontend files and their roles in the project.",
  "frontend/index.css": "Defines Tailwind layers and custom OKLCH theme tokens for light and dark mode with global styling.",
  "frontend/index.html": "HTML entry point enabling dark mode by default with fixed background, fonts, favicon, and script mount point.",
  "frontend/postcss.config.cjs": "PostCSS configuration enabling Tailwind and Autoprefixer plugins.",
  "frontend/src/App.tsx": "Main SPA component rendering header, hero, navigable sections, menu categories, and business info.",
  "frontend/src/components/LocationMapPreview.tsx": "Map preview component with Google Maps iframe and fallback card when loading fails.",
  "frontend/src/components/MenuCategoryGrid.tsx": "Renders a category card with title and grid of MenuItemCard components.",
  "frontend/src/components/MenuItemCard.tsx": "Renders a menu item card with dynamic price variants and WhatsApp ordering, including variant selection through a dialog.",
  "frontend/src/components/RevealableSection.tsx": "Displays a section only when marked revealed, wrapping content in a Section component.",
  "frontend/src/components/SafeImage.tsx": "Image component that swaps to a fallback source on load error and resets when the input source changes.",
  "frontend/src/components/Section.tsx": "Generic page section wrapper applying layout padding and themed background classes.",
  "frontend/src/components/SiteHeader.tsx": "Fixed top navigation header with logo and buttons that trigger section navigation.",
  "frontend/src/content/business.ts": "Central business configuration defining branding, social links, hours, contact info, and menu data with image helpers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query backend hooks.",
  "frontend/src/hooks/useRevealableSections.ts": "Manages which site section is active and revealed, providing scroll behavior after activation.",
  "frontend/src/index.css": "Tailwind base styles and theme variables defining colors, components, and scrollbar-hiding rules.",
  "frontend/src/lib/whatsapp.ts": "Provides functions to derive menu item variant options and build a WhatsApp deep link with a prefilled order message.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with extended theme settings, plugins, colors, animations, and container options.",
  "project_state.json": "Stores project metadata, requirements, known issues, and architectural notes for the website build."
}