{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing UI cleanup and logo fixes with associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and functionality of various frontend files.",
  "frontend/index.css": "Tailwind base layers plus extensive OKLCH CSS variables for light/dark themes and global background/text setup.",
  "frontend/index.html": "HTML entry point defining metadata, fonts, favicon, solid light background, and mounts the React app.",
  "frontend/postcss.config.cjs": "PostCSS config enabling Tailwind and autoprefixer.",
  "frontend/src/App.tsx": "Main React app rendering header, hero, menu sections, social icons, and business info with revealable sections.",
  "frontend/src/components/LocationMapPreview.tsx": "Map preview with iframe loading logic and automatic fallback card if embedding fails or times out.",
  "frontend/src/components/MenuCategoryGrid.tsx": "Renders category banner, HND watermark, and animated grid of menu items.",
  "frontend/src/components/MenuItemCard.tsx": "Menu item card with price display, animations, and WhatsApp ordering with optional variant selection dialog.",
  "frontend/src/components/PremiumBasicSpecialPanels.tsx": "Implements a tabbed UI showing premium, basic, and special panels with animated cards and descriptions.",
  "frontend/src/components/RevealableSection.tsx": "Wraps content in a Section and handles reveal/hide with fade-in/fade-out animation logic.",
  "frontend/src/components/SafeImage.tsx": "Image component that swaps to a fallback source if the main image fails to load and resets on src change.",
  "frontend/src/components/Section.tsx": "Provides a styled section wrapper with variant-based background classes and fade-in animation.",
  "frontend/src/components/SiteHeader.tsx": "Renders a fixed header with logo and navigation buttons that trigger section navigation.",
  "frontend/src/content/business.ts": "Stores business details, menu image helpers, social links, hours, contact info, and address configuration.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actors based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Sets up Internet Identity context, handling login, logout, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query backend hooks; currently empty.",
  "frontend/src/hooks/useRevealableSections.ts": "Tracks the active section and controls reveal state and scroll behavior for page sections.",
  "frontend/src/index.css": "Defines Tailwind base layers, custom color variables for light/dark themes, global resets, scrollbar hiding, and animation keyframes/utilities.",
  "frontend/src/lib/whatsapp.ts": "Provides utilities to derive menu item variants and generate WhatsApp deep links with prefilled order messages.",
  "frontend/src/main.tsx": "Bootstraps the React app using ReactDOM, sets up React Query, Internet Identity provider, and imports global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, shadows, animations, plugins, and content paths based on CSS variables.",
  "project_state.json": "Stores the project’s current state, requirements, issues, and branding/theme directives for ongoing development."
}