{
  "kind": "build_request",
  "title": "Fix HND logo asset and remove “Built with Caffeine” footer credit",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-80",
      "text": "Remove any visible “Built with … using caffeine.ai” credit/label from the UI, including any outbound link to caffeine.ai, and ensure it is not rendered in the footer or anywhere else in the production UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-8"
        ],
        "quotes": [
          "HND KA logo Sahi kro or BUILD WITH CAFFEINE remove KR do",
          "Continue"
        ]
      },
      "acceptanceCriteria": [
        "No text containing “Built with”, “Caffeine”, or “caffeine.ai” is visible anywhere in the app UI (including the footer).",
        "There is no outbound link to caffeine.ai rendered anywhere in the UI.",
        "Build succeeds and no unused imports/variables remain from removing the credit label."
      ]
    },
    {
      "id": "REQ-81",
      "text": "Fix the HND logo so it renders cleanly on the site (no visible background box/edges), and apply the corrected logo asset consistently everywhere the HND logo is shown (header logo, hero logo, and menu category watermark).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-8"
        ],
        "quotes": [
          "HND KA logo Sahi kro or BUILD WITH CAFFEINE remove KR do",
          "Continue"
        ]
      },
      "acceptanceCriteria": [
        "The HND logo image has a fully transparent background with clean edges when displayed on the site theme.",
        "The SiteHeader logo, Hero logo, and MenuCategoryGrid watermark all reference the same corrected logo asset path.",
        "Logo rendering remains crisp and correctly sized on mobile and desktop, with no layout shifts or broken image fallbacks."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them only).",
    "Do not edit any frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "No new site sections or new content additions beyond removing the Caffeine credit and fixing the logo asset.",
    "No changes to menu item names or prices.",
    "No backend changes (Motoko actor) are required for this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Make the logo background fully transparent with clean edges (hnd-logo-badge-chef-transparent-fixed.dim_512x512.png > hnd-logo-badge-chef-transparent-clean.dim_512x512.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}