{
  "kind": "build_request",
  "title": "Remove Caffeine credit/heart, adjust logo background to light green, refine text colors, and add subtle animations",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-62",
      "text": "Remove any visible “Built with … using caffeine.ai” credit/label from the UI, including the outbound link to caffeine.ai in the footer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Is ma build with using caffeine LIKHA ha wo HTA do"
        ]
      },
      "acceptanceCriteria": [
        "The footer no longer renders any text that mentions “Built with”, “using caffeine.ai”, “caffeine.ai”, or similar Caffeine build credit wording.",
        "No caffeine.ai referral link is present anywhere in the rendered UI.",
        "All other footer content (copyright line, year, business name) remains visible and unchanged."
      ]
    },
    {
      "id": "REQ-63",
      "text": "Remove the heart emoji/heart symbol from the production UI (including any heart icon used inline with text) while keeping user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...or heart Wala emoji bhi HTA do"
        ]
      },
      "acceptanceCriteria": [
        "No heart emoji (e.g., ❤️) is rendered anywhere in the UI.",
        "No heart icon/symbol is rendered inline as a decorative replacement for emoji (e.g., the footer line currently using a Heart icon is removed or updated to not include a heart).",
        "No new non-English user-facing strings are introduced as part of this change."
      ]
    },
    {
      "id": "REQ-64",
      "text": "Update HND logo presentation so the logo appears with a light-green background behind it (e.g., a rounded badge/container), while keeping the logo image itself intact and transparent where applicable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...or HND logo ka background light green ma rakho"
        ]
      },
      "acceptanceCriteria": [
        "The HND logo in the header and hero is displayed on top of a clearly visible light-green background shape (badge/container).",
        "The light-green background does not create visible jagged edges/boxes around the logo image itself (logo image should still look clean on the dark theme).",
        "Logo remains accessible with appropriate alt text unchanged (e.g., “HND Restaurant logo”)."
      ]
    },
    {
      "id": "REQ-65",
      "text": "Adjust the site-wide typography color palette so text is not rendered as pure white everywhere; keep strong readability on the dark theme, and add subtle UI animations for a more lively feel without changing the site’s content/sections.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...or sb Text or font white colour na rakho or animated rakho"
        ]
      },
      "acceptanceCriteria": [
        "Primary text (foreground) is changed from pure/near-pure white to a slightly softer off-white, while maintaining strong contrast on the dark background.",
        "Muted text remains visibly readable (not too dim) and maintains hierarchy vs. headings/body text.",
        "Subtle animations are present (e.g., gentle entrance/fade/slide for sections or cards, and/or refined hover/focus transitions) without adding new sections or changing existing content text.",
        "No changes are made to menu item names/prices text content; animations must not interfere with navigation/section swapping behavior."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep user-facing text in English.",
    "Do not change existing menu item names/prices/content text; only adjust styling/decoration/animations.",
    "Backend remains single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Adding new pages or new site sections.",
    "Introducing any backend features or persistence changes.",
    "Adding third-party animation libraries beyond what is already available in the project."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}