{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix HND logo asset rendering and remove Caffeine credit from UI",
  "requirements": [
    {
      "id": "REQ-80",
      "summary": "Remove any visible “Built with … using caffeine.ai” UI credit/label and outbound link to caffeine.ai from the production UI.",
      "acceptanceCriteria": [
        "No text containing “Built with”, “Caffeine”, or “caffeine.ai” is visible anywhere in the app UI (including the footer).",
        "There is no outbound link to caffeine.ai rendered anywhere in the UI.",
        "Build succeeds and no unused imports/variables remain from removing the credit label."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove any footer (or other) rendered credit/label that includes “Built with…”, “Caffeine”, or “caffeine.ai”, including any anchor tag linking to caffeine.ai; then clean up any now-unused imports/variables (e.g., icons/year variables) to ensure a clean build."
        }
      ]
    },
    {
      "id": "REQ-81",
      "summary": "Replace the HND logo with a transparent, clean-edged asset and use the same corrected asset everywhere the HND logo appears (header, hero, and menu watermark).",
      "acceptanceCriteria": [
        "The HND logo image has a fully transparent background with clean edges when displayed on the site theme.",
        "The SiteHeader logo, Hero logo, and MenuCategoryGrid watermark all reference the same corrected logo asset path.",
        "Logo rendering remains crisp and correctly sized on mobile and desktop, with no layout shifts or broken image fallbacks."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/hnd-logo-badge-chef-transparent-clean.dim_512x512.png",
          "operation": "create",
          "description": "Add the corrected transparent-clean HND logo asset (from the requested edit: hnd-logo-badge-chef-transparent-fixed.dim_512x512.png > hnd-logo-badge-chef-transparent-clean.dim_512x512.png) so it renders without background box/edges."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the Hero logo to reference the single corrected asset path: frontend/public/assets/generated/hnd-logo-badge-chef-transparent-clean.dim_512x512.png, ensuring sizing remains object-contain and consistent."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update the header logo to reference the same corrected asset path (frontend/public/assets/generated/hnd-logo-badge-chef-transparent-clean.dim_512x512.png) and confirm the logo remains crisp and correctly sized across breakpoints."
        },
        {
          "path": "frontend/src/components/MenuCategoryGrid.tsx",
          "operation": "modify",
          "description": "Update the menu category watermark image to reference the same corrected asset path (frontend/public/assets/generated/hnd-logo-badge-chef-transparent-clean.dim_512x512.png) so the watermark uses the clean-edged transparent logo consistently."
        }
      ]
    }
  ]
}