{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Menu category banner images for Salad/Soup and remove beer imagery from Drinks visuals",
  "requirements": [
    {
      "id": "REQ-72",
      "summary": "Update menu category banner image mapping so Salad/Soup categories use appropriate photos and Drinks categories use juice/cold-drink imagery, by adjusting banner image references in frontend/src/content/business.ts only (no item/name/price changes).",
      "acceptanceCriteria": [
        "In the Menu UI, the category banner for \"Lawazmat (Salads)\" displays a salad-related image (not a drinks image).",
        "In the Menu UI, the category banner for \"Salad\" displays a salad-related image (not a drinks image).",
        "In the Menu UI, the category banner for \"Soup\" displays a soup-related image (not a drinks image).",
        "In the Menu UI, the category banners for \"Hot & Cold Bar\" and \"Fresh Juice Seasonal\" display drinks imagery that represents juice/cold drinks and does not include beer imagery.",
        "No menu item names, descriptions/notes, or prices are modified in `frontend/src/content/business.ts`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/business.ts",
          "operation": "modify",
          "description": "Update category banner mapping by adding salad/soup entries to categoryBannerImages and switching the category `image` fields for \"Lawazmat (Salads)\" and \"Salad\" to use the salad banner, and \"Soup\" to use the soup banner; keep \"Hot & Cold Bar\" and \"Fresh Juice Seasonal\" using the drinks banner. Do not change any menu item names/descriptions/notes/prices."
        }
      ]
    },
    {
      "id": "REQ-73",
      "summary": "Add/replace static generated banner/thumb image assets so all referenced category banners render without broken images and drinks visuals contain no beer imagery.",
      "acceptanceCriteria": [
        "New banner image files for Salad and Soup exist under `frontend/public/assets/generated/` with the exact filenames referenced by `frontend/src/content/business.ts`.",
        "The existing drinks banner image file used by the drinks categories is updated so it contains no beer imagery and visually matches juice/cold drinks.",
        "No category banner image renders as a broken image icon; if an image fails, the existing `SafeImage` fallback behavior continues to work."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/menu-category-salad.dim_1600x900.jpg",
          "operation": "create",
          "description": "Add the required Salad category banner photo asset (menu-category-salad.dim_1600x900.jpg) as a static file so category banner references resolve at runtime."
        },
        {
          "path": "frontend/public/assets/generated/menu-category-soup.dim_1600x900.jpg",
          "operation": "create",
          "description": "Add the required Soup category banner photo asset (menu-category-soup.dim_1600x900.jpg) as a static file so category banner references resolve at runtime."
        },
        {
          "path": "frontend/public/assets/generated/menu-category-drinks.dim_1600x900.jpg",
          "operation": "modify",
          "description": "Replace/update the existing drinks category banner image to remove any beer imagery and ensure it visually represents juice/cold drinks; keep the filename unchanged so current references continue to work."
        },
        {
          "path": "frontend/public/assets/generated/menu-thumb-drinks-hnd.dim_256x256.jpg",
          "operation": "modify",
          "description": "Replace/update the existing drinks thumbnail image to remove any beer imagery and ensure it visually represents juice/cold drinks; keep the filename unchanged so current references continue to work."
        }
      ]
    }
  ]
}