{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Hide menu item photos, remove watermark, fix logo transparency, and brighten muted text",
  "requirements": [
    {
      "id": "REQ-58",
      "summary": "Remove/hide per-menu-item food photos from Menu item cards while preserving existing text, prices, and WhatsApp ordering/variant selection behavior.",
      "acceptanceCriteria": [
        "In the Menu section, each Menu item card renders without any visible food image/thumbnail area.",
        "Menu item name, optional description/note, and prices render exactly as before (no changes to menu text/prices).",
        "The 'Order on WhatsApp' button remains available per item, and the variant-selection dialog still appears for items with multiple variants.",
        "No empty/blank placeholder image container is shown where the photo used to be."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MenuItemCard.tsx",
          "operation": "modify",
          "description": "Remove the image/thumbnail column (including SafeImage usage) from the Menu item card layout so only text content, prices, and WhatsApp order controls render; keep variant-selection dialog behavior unchanged."
        },
        {
          "path": "frontend/src/components/MenuCategoryGrid.tsx",
          "operation": "modify",
          "description": "Adjust any grid/card sizing assumptions (if present) so Menu item cards lay out cleanly without an image column and without leaving reserved/blank image space."
        }
      ]
    },
    {
      "id": "REQ-59",
      "summary": "Remove the HND watermark/logo overlay styling and rendering from Menu item cards.",
      "acceptanceCriteria": [
        "No HND watermark overlay is rendered anywhere within Menu item cards.",
        "The CSS class/styles dedicated to the Menu watermark do not cause any visual artifacts or layout spacing issues in the Menu section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MenuItemCard.tsx",
          "operation": "modify",
          "description": "Remove the watermark overlay markup from Menu item cards (now that photos are removed) so no overlay element is rendered."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Remove the menu watermark CSS rules (e.g., .menu-watermark-premium) to prevent leftover styling from affecting layout or visuals."
        }
      ]
    },
    {
      "id": "REQ-60",
      "summary": "Update header and hero to use fixed transparent HND logo assets (and update favicon) so no background box/edges appear on the dark theme.",
      "acceptanceCriteria": [
        "The HND logo displayed in the header and hero appears with a transparent background on the dark UI (no visible box, halo, or solid fill around the logo).",
        "If updated logo filenames are introduced, all current logo usages (header and hero) reference the updated filenames and load successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/hnd-logo-badge-chef-transparent-fixed.dim_512x512.png",
          "operation": "create",
          "description": "Add the corrected transparent logo asset (background/edges cleanly removed) as a static frontend asset at this exact path/filename."
        },
        {
          "path": "frontend/public/assets/generated/hnd-favicon-badge-chef-fixed.dim_64x64.png",
          "operation": "create",
          "description": "Add the corrected transparent favicon asset (background/edges cleanly removed) as a static frontend asset at this exact path/filename."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update the header logo reference to use /assets/generated/hnd-logo-badge-chef-transparent-fixed.dim_512x512.png so the logo renders with a clean transparent background."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the hero logo reference to use /assets/generated/hnd-logo-badge-chef-transparent-fixed.dim_512x512.png so the logo renders with a clean transparent background."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the favicon reference to use /assets/generated/hnd-favicon-badge-chef-fixed.dim_64x64.png so the favicon uses the corrected transparent asset."
        }
      ]
    },
    {
      "id": "REQ-61",
      "summary": "Brighten site-wide muted/secondary text colors for better readability on the premium dark theme without changing any text content.",
      "acceptanceCriteria": [
        "Body text remains bright and readable across all sections on the dark background.",
        "Muted text (elements using muted-foreground) is lighter than before and remains readable (no low-contrast gray-on-dark).",
        "No user-facing text content is changed (English text remains the same)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust the theme token(s) for muted text (notably --muted-foreground in the dark theme variables) to a noticeably lighter value while maintaining hierarchy and contrast."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "If this global token file is used in the build, align its dark-mode --muted-foreground (and any related muted text tokens) with the brighter muted text color so muted text is consistently more readable across the app."
        }
      ]
    }
  ]
}